{"_path":"/blog/do-you-need-a-waste-license","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Do You Need A Waste License?","description":"Why do waste exemptions exist?  Who's eligible for a waste exemption?  What else do I need to know?","head":{"meta":[{"name":"keywords","content":"GoTrash, Waste License"},{"name":"robots","content":"noindex, nofollow"},{"name":"author","content":"GoTrash"},{"name":"copyright","content":"© 2023 GoTrash"}]},"date":"2024-04-28T00:00:00.000Z","image":{"url":"/images/blog/3291029_0df4cba4_original.jpg","photographer":{"name":"Jim Barton","url":"https://www.geograph.org.uk/profile/26362","license":{"label":"Creative Commons License","url":"http://creativecommons.org/licenses/by-sa/2.0/"}}},"featured":true,"author":[{"name":"Claire Kelleher","role":"Staff Writer","email":"claire.kelleher@gotrash.co.uk"}],"links":[{"title":"Search the Register of Waste Exemptions","url":"https://environment.data.gov.uk/public-register/view/search-waste-exemptions"},{"title":"Check if you need an environmental permit","url":"https://www.gov.uk/guidance/check-if-you-need-an-environmental-permit"},{"title":"Register, renew or update a Waste Exemption","url":"https://www.gov.uk/guidance/register-your-waste-exemptions-environmental-permits#exemptions-you-do-not-need-to-register"}],"summary":"<p>If you or someone you know transports or is going to transport somebody else’s waste then a waste license is an absolute requirement,\neven if the waste is being moved in a non-professional capacity and even if the person moving the waste is not receiving any financial remuneration for it.</p>\n","body":{"type":"root","children":[{"type":"element","tag":"h2","props":{"id":"do-you-need-a-waste-carrier-licence"},"children":[{"type":"text","value":"Do you need a waste carrier licence?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"Last updated May 1, 2024"}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you or someone you know transports someone else’s waste, as part of their trade or to make money must be registered as a waste carrier with the Environment Agency."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Tradesmen transporting building, demolition or refurbishment rubbish they have created themselves must also be registered as a waste carrier."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The requirement to be licensed as a waste carrier applies regardless of where the waste is taken or whether the waste carrier is a sole trader, partnership or limited company."}]},{"type":"element","tag":"h2","props":{"id":"how-to-register"},"children":[{"type":"text","value":"How to register?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Registering as a waste carrier is actually very straightforward and is a legal requirement to do so."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Did you know that registering is FREE if you are only transporting waste you have produced yourself."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you are asking a friend or family member for a favour you may want to think twice as even doing this without a valid, registered waste licence can lead to unfortunate consequences."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You can register or renew through the Government website. Once you’ve registered, your organisation’s details appear in the public register of waste carriers, brokers & dealers. Registration lasts three years, after which it can be renewed. This may incur a cost."}]},{"type":"element","tag":"h2","props":{"id":"what-happens-if-you-dont-register"},"children":[{"type":"text","value":"What happens if you don’t register?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Failure to register as a waste carrier is illegal and, if caught, will result in criminal prosecution, including an unlimited fine and seizure of the vehicle used to transport the waste. Make sure your licence is always valid."}]},{"type":"element","tag":"h2","props":{"id":"what-does-this-mean-for-people-with-waste-to-dispose-of"},"children":[{"type":"text","value":"What does this mean for people with waste to dispose of?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The fact that the registration process is so easy means that waste carriers who aren’t licensed are likely to be cowboys who intend to dispose of the waste unlawfully. So, if you use contractors (like builders, landscape gardeners, tree surgeons, carpet fitters, skip hire companies, house clearance companies, furniture retailers, skip companies, or scrap metal merchants) who are removing waste items from your property, ask them for their waste carrier licence number & a waste transfer note. If you are using our service then all of our providers will be fully licensed."}]},{"type":"element","tag":"h2","props":{"id":"difference-between-licences-across-england-wales-scotland-northern-ireland"},"children":[{"type":"text","value":"Difference between licences across; England, Wales, Scotland & Northern Ireland."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As expected, there are variations to the waste carriers licence rules between each country in the United Kingdom. Here’s a quick breakdown on the differences, including the waste carriers licence cost and registration details for each."}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"(England): In England, there are two different waste licence options available: “upper tier” and “lower tier.” For those under the lower tier classification, there is no fee to register. For an upper tier registration, this will cost £154. After every three years, an upper tier registration will need to be renewed at a fee of £105."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"(Wales): For a waste management licence in Wales, it is necessary to register with Natural Resource Wales. The country utilises the same “upper tier” and “lower tier” system as England, and the upper tier registration and renewal fees are also identical. To renew waste carriers licence in Wales or England, this can be done through the Environmental Licences Waste Carrier Licence Renewal Form."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"(Scotland): When you apply for a waste carriers licence in Scotland, you need to first contact the Scottish Environment Protection Agency (SEPA). For a SEPA waste carriers licence, there are two registration types available. Firstly, there’s the professional carriers of waste registration which covers various different fields. No fee is involved with this option, and there might not even be a need to register if waste is only carried on occasion. For those not deemed a ‘professional carrier,’ they will have to register as either a carrier or broker – or both. Registration costs £174, while renewal is £119 every three years. For those who want to add either a carrier or broker category to their current registration, this costs £43."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"(NI): The Northern Ireland Environment Agency (NIEA) must be contacted by those seeking a waste carrying licence. NI also uses a “lower tier” and “upper tier” system. There is no fee for those under the lower tier category, whereas there are fees for registering and renewing as an upper tier waste carrier."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The one aspect that is shared between all four countries: if you fail to sign up on the relevant waste carriers register, you can be fined up to £5,000 in total."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"do-you-need-a-waste-carrier-licence","depth":2,"text":"Do you need a waste carrier licence?"},{"id":"how-to-register","depth":2,"text":"How to register?"},{"id":"what-happens-if-you-dont-register","depth":2,"text":"What happens if you don’t register?"},{"id":"what-does-this-mean-for-people-with-waste-to-dispose-of","depth":2,"text":"What does this mean for people with waste to dispose of?"},{"id":"difference-between-licences-across-england-wales-scotland-northern-ireland","depth":2,"text":"Difference between licences across; England, Wales, Scotland & Northern Ireland."}]}},"_type":"markdown","_id":"blog:blog:do-you-need-a-waste-license.md","_source":"blog","_file":"blog/do-you-need-a-waste-license.md","_extension":"md"}